---
kind: method
id: M:Autodesk.Revit.DB.MEPSize.Dispose
source: html/85380056-b280-05d8-14fb-f6a2a77eff52.htm
---
# Autodesk.Revit.DB.MEPSize.Dispose Method

Releases all resources used by the MEPSize

## Syntax (C#)
```csharp
public void Dispose()
```